tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'

brew 'asdf'
brew 'curl'
brew 'entr'
brew 'fd'
brew 'fish'
brew 'git'
brew 'jq'
brew 'rlwrap'
brew 'ripgrep'
brew 'shellcheck'
brew 'tmux'
brew 'tree'

cask '1password'
cask 'alacritty'
cask 'appcleaner'
cask 'elektron-overbridge'
cask 'elektron-transfer'
cask 'firefox'
cask 'flux'
cask 'font-iosevka'
cask 'keepingyouawake'
cask 'musescore'
cask 'postgres'
cask 'pgadmin4'
cask 'rectangle'
cask 'skype'
cask 'spotify'
