tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

brew 'curl'
brew 'fd'
brew 'fzf'
brew 'fish'
brew 'fnm'
brew 'git'
brew 'gmp'
brew 'go'
brew 'gron'
brew 'jq'
brew 'opam'
brew 'pkg-config'
brew 'ripgrep'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'vim'

cask '1password'
cask 'alacritty'
cask 'emacs'
cask 'firefox'
cask 'font-iosevka'
cask 'google-chrome'
cask 'keepingyouawake'
cask 'musescore'
cask 'postgres'
cask 'rectangle'
cask 'skype'
cask 'spotify'
cask 'visual-studio-code'
cask 'xquartz'
