# vim:syntax=ruby:ft=ruby

tap 'homebrew/cask'
tap 'buo/cask-upgrade'

brew 'cloc'
brew 'difftastic'
brew 'dsda-doom'
brew 'duckdb'
brew 'entr'
brew 'fd'
# brew 'ffmpeg'
brew 'fish'
brew 'git'
brew 'git-lfs'
brew 'graphviz'
brew 'gron'
brew 'hyperfine'
brew 'jj'
brew 'jq'
brew 'just'
brew 'llama.cpp'
brew 'llvm'
brew 'lld'
brew 'protobuf'
brew 'neovim'
brew 'raylib'
brew 'ripgrep'
brew 'rlwrap'
brew 'sbcl'
brew 'tree'
brew 'xz'

cask 'claude'
cask 'cursorcerer'
cask 'drawio'
cask 'dungeon-crawl-stone-soup-tiles', args: { 'no-quarantine': true }
cask 'firefox@beta'
cask 'font-iosevka-term-nerd-font'
cask 'ghostty', args: { 'no-quarantine': true }
cask 'godot'
cask 'google-chrome'
cask 'keyboardcleantool'
cask 'libreoffice'
cask 'linearmouse'
cask 'loopback'
cask 'moonlight'
cask 'netlogo'
cask 'orion'
cask 'rectangle'
cask 'skype'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
cask 'zed@preview', args: { 'no-quarantine': true }
