tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'buo/cask-upgrade'
tap 'borkdude/brew'
tap 'clojure-lsp/brew'

brew 'clj-kondo'
brew 'clojure-lsp-native'
brew 'entr'
brew 'fd'
brew 'fish'
brew 'git'
brew 'gron'
brew 'hugo'
brew 'jq'
brew 'ripgrep'
brew 'rlwrap'
brew 'rustup'
brew 'shellcheck'
brew 'tree'

cask '1password'
cask 'firefox'
cask 'font-iosevka'
cask 'google-chrome'
cask 'kitty', args: { 'no-quarantine': true }
cask 'postgres-unofficial'
cask 'rectangle'
cask 'skype'
cask 'spotify'
cask 'visual-studio-code'
cask 'stellarium'
